JP_CHILDREN_KEY_MAP = {
    '定': ['定', 'OK', 'NG', 'おはよう', 'こんにちは', 'さようなら', 'お腹すいた'],
    'あ': ['あ', 'い', 'う', 'え', 'お'],
    'か': ['か', 'き', 'く', 'け', 'こ'],
    'さ': ['さ', 'し', 'す', 'せ', 'そ'],
    'た': ['た', 'ち', 'つ', 'て', 'と'],
    'な': ['な', 'に', 'ぬ', 'ね', 'の'],
    'は': ['は', 'ひ', 'ふ', 'へ', 'ほ'],
    'ま': ['ま', 'み', 'む', 'め', 'も'],
    'や': ['や', '(' , 'ゆ', ')' , 'よ'],
    'ら': ['ら', 'り', 'る', 'れ', 'ろ'],
    '小': ['小', '濁', '小', '半', ''  ],
    'わ': ['わ', 'を', 'ん', 'ー', '〜'],
    '、': ['、', '。', '？', '！', '…'],
}

with open('template.txt', mode="r") as f:
    line = f.readlines()

text = []
for i in line:
    if '\n' in i:
        i = i.replace('\n', '')
    if i[0] == '#':
        continue
    text.append(i)

JP_CHILDREN_KEY_MAP['定'] = text